{
  "config": {
    "error": {
      "bluetooth_integration_required": "Bluetooth integration is required to configure Skelly Ultra",
      "no_devices_found": "No devices found",
      "rest_server_unreachable": "Cannot connect to Skelly Ultra REST server. Please ensure the server is running at the specified URL.",
      "rest_server_error": "REST server returned an error. Please check the server is running correctly.",
      "address_required": "Device address is required in manual mode"
    },
    "step": {
      "user": {
        "title": "Configure Skelly Ultra",
        "data": {
          "use_ble_proxy": "Use BLE proxy mode",
          "mode": "Configuration mode",
          "address": "Bluetooth address",
          "name": "Friendly name",
          "server_url": "REST server URL"
        },
        "data_description": {
          "use_ble_proxy": "Enable this to connect via REST server instead of direct BLE (useful for remote access or systems without BLE hardware)",
          "mode": "Choose 'scan' to discover nearby devices, or 'manual' to enter the address directly",
          "address": "MAC address of the Skelly device (required in manual mode, optional when scanning)",
          "server_url": "URL of the Skelly Ultra REST server. Required for proxy mode and live mode features (default: http://localhost:8765)"
        }
      },
      "server_warning": {
        "title": "REST server not running",
        "description": "The REST server could not be reached. The integration will work for basic control, but live mode will not be available. See documentation: {docs_url}",
        "data": {
          "acknowledged": "I understand that live mode will not be available"
        }
      }
    }
  },
  "entity": {
    "sensor": {
      "file_transfer_progress": {
        "name": "File transfer progress"
      }
    },
    "switch": {
      "connected": {
        "name": "Connected"
      }
    }
  },
  "services": {
    "enable_classic_bt": {
      "name": "Enable classic Bluetooth",
      "description": "Make the Skelly Ultra expose a classic Bluetooth speaker to connect to for live mode."
    },
    "play_file": {
      "name": "Play file",
      "description": "Play a file from the device's internal storage by file index.",
      "fields": {
        "file_index": {
          "name": "File index",
          "description": "The 1-based index of the file to play (must be at least 1)."
        }
      }
    },
    "stop_file": {
      "name": "Stop file",
      "description": "Stop a file that is currently playing on the device by file index.",
      "fields": {
        "file_index": {
          "name": "File index",
          "description": "The 1-based index of the file to stop (must be at least 1)."
        }
      }
    },
    "cancel_file_transfer": {
      "name": "Cancel file transfer",
      "description": "Cancel an ongoing file upload to the device."
    },
    "send_file": {
      "name": "Send file",
      "description": "Upload an audio file to the device. The file will be automatically converted to 8kHz mono MP3 format if needed. Supports local files and HTTP/HTTPS URLs, including Home Assistant media files (/media/...).",
      "fields": {
        "file_path": {
          "name": "File path",
          "description": "Path to the audio file. Can be a local file path, HTTP/HTTPS URL, or Home Assistant media path (/media/...)."
        },
        "target_filename": {
          "name": "Target filename",
          "description": "Name to save the file as on the device (without extension). The .mp3 extension will be added automatically."
        }
      }
    },
    "delete_file": {
      "name": "Delete file",
      "description": "Delete a file from the Skelly device's internal storage. The file can be specified either by file_index and cluster (both required), or by filename. The service will refresh the file list before and after the delete operation.",
      "fields": {
        "device_id": {
          "name": "Device ID",
          "description": "The device registry ID of the Skelly device to target."
        },
        "entity_id": {
          "name": "Entity ID",
          "description": "An entity ID associated with the device. If provided, the device_id will be derived from this entity."
        },
        "file_index": {
          "name": "File index",
          "description": "The 0-based index of the file to delete. Must be used together with cluster. Mutually exclusive with filename."
        },
        "cluster": {
          "name": "Cluster",
          "description": "The cluster value of the file to delete. Must be used together with file_index. Mutually exclusive with filename."
        },
        "filename": {
          "name": "Filename",
          "description": "The name of the file to delete (e.g., 'announcement.mp3'). The service will look up the corresponding file_index and cluster. Mutually exclusive with file_index and cluster."
        }
      }
    }
  }
}
